-- --------------------------------------------------------------
-- QueryPie Schema Export Script
-- https://www.querypie.com
--
-- Database: connectbranch
-- Generated At: 04/19/2023 04:55:17 +00:00
-- --------------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


CREATE TABLE `guide` (
  `id` bigint(20) NOT NULL COMMENT 'PK',
  `created` datetime(6) NOT NULL COMMENT '생성일',
  `enabled` varchar(1) COLLATE utf8mb4_bin NOT NULL COMMENT '사용 상태',
  `is_branch_open` varchar(1) COLLATE utf8mb4_bin NOT NULL COMMENT '브랜치 전체 오픈',
  `is_team_open` varchar(1) COLLATE utf8mb4_bin NOT NULL COMMENT '팀 전체 오픈',
  `modified` datetime(6) NOT NULL COMMENT '수정일',
  `name` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '이름',
  `type` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '타입',
  `branch_id` bigint(20) DEFAULT NULL COMMENT '가이드를 사용할 브랜치 PK',
  `creator` bigint(20) NOT NULL COMMENT '생성자 PK',
  `guide_category_id` bigint(20) NOT NULL COMMENT '카테고리 PK',
  `modifier` bigint(20) NOT NULL COMMENT '수정자 PK',
  `team_id` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `IDX_GUIDE__BRANCH_CATEGORY` (`branch_id`,`guide_category_id`),
  KEY `IDX_GUIDE__BRANCH_NAME` (`branch_id`,`name`),
  KEY `FK_GUIDE__CREATOR` (`creator`),
  KEY `FK_GUIDE__GUIDE_CATEGORY` (`guide_category_id`),
  KEY `FK_GUIDE__MODIFIER` (`modifier`),
  KEY `FKj4e87jyne0oa0047fmr4st9y9` (`team_id`),
  CONSTRAINT `FK_GUIDE__BRANCH` FOREIGN KEY (`branch_id`) REFERENCES `branch` (`id`),
  CONSTRAINT `FK_GUIDE__CREATOR` FOREIGN KEY (`creator`) REFERENCES `member` (`id`),
  CONSTRAINT `FK_GUIDE__GUIDE_CATEGORY` FOREIGN KEY (`guide_category_id`) REFERENCES `guide_category` (`id`),
  CONSTRAINT `FK_GUIDE__MODIFIER` FOREIGN KEY (`modifier`) REFERENCES `member` (`id`),
  CONSTRAINT `FKj4e87jyne0oa0047fmr4st9y9` FOREIGN KEY (`team_id`) REFERENCES `team` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

LOCK TABLES guide WRITE;

INSERT INTO 
  guide (id, created, enabled, is_branch_open, is_team_open, modified, name, type, branch_id, creator_id, guide_category_id, modifier_id, team_id)
VALUES 
  ('16018', '2023-03-17 14:04:20.272000', 'Y', 'N', 'Y', '2023-03-17 14:04:20.272000', 'ㅌㅌㅌ', 'single', '15986', '15998', '16015', '16002', '16395'), 
  ('16023', '2023-03-17 14:05:47.163000', 'Y', 'N', 'Y', '2023-03-17 14:05:47.163000', 'dd', 'single', '15986', '15998', '16015', '16002', '16395'), 
  ('16054', '2023-03-17 14:36:57.324000', 'Y', 'N', 'N', '2023-03-17 14:36:57.324000', 'kepmanager1 가이드 추가 테스트', 'single', '15556', '15998', '16015', '16002', '15574'), 
  ('16059', '2023-03-17 14:41:35.246000', 'Y', 'N', 'N', '2023-03-17 14:41:35.246000', 'kepadmin1 가이드 추가 테스트', 'single', '15986', '16002', '16015', '16002', '16042'), 
  ('16062', '2023-03-17 14:43:17.206000', 'Y', 'N', 'Y', '2023-03-17 14:43:17.206000', 'ㅁㄴㅇㅁㄴㅇ1', 'single', '15986', '16002', '16015', '16002', '16395'), 
  ('16072', '2023-03-17 15:09:50.095000', 'Y', 'N', 'N', '2023-03-17 15:09:50.095000', '테스트1', 'process', '16275', '15998', '16015', '16002', '16288'), 
  ('16087', '2023-03-17 15:16:26.433000', 'Y', 'N', 'Y', '2023-03-17 15:16:26.433000', 'ddd', 'single', '16275', '15998', '16015', '16002', NULL), 
  ('16577', '2023-03-20 16:53:12.286000', 'Y', 'N', 'Y', '2023-03-20 16:53:12.286000', '처음추가', 'single', '15986', '16002', '16015', '16002', '16042'), 
  ('16593', '2023-03-20 17:11:17.744000', 'N', 'N', 'Y', '2023-03-20 17:11:17.744000', '액션 임시저장 - 버튼삭제후 임시저장', 'single', '15986', '16002', '16015', '16002', '16042'), 
  ('16897', '2023-03-22 16:00:45.467000', 'Y', 'N', 'N', '2023-03-22 16:00:45.467000', '전체 오픈 되나요', 'single', '15986', '15998', '16896', '15998', '16042'), 
  ('19623', '2023-04-10 16:50:45.632000', 'Y', 'Y', 'Y', '2023-04-10 16:50:45.632000', '가입 및 로그인', 'process', '1', '2', '19615', '2', NULL), 
  ('19642', '2023-04-10 17:57:42.805000', 'Y', 'Y', 'Y', '2023-04-10 17:57:42.805000', '음성명령은 어떻게 하는 건가요?', 'single', '1', '2', '19615', '2', NULL), 
  ('19646', '2023-04-10 18:00:04.071000', 'Y', 'Y', 'Y', '2023-04-10 18:00:04.071000', 'A/S', 'single', '1', '2', '19615', '2', NULL), 
  ('19686', '2023-04-10 19:40:41.685000', 'Y', 'Y', 'Y', '2023-04-10 19:40:41.685000', '카카오미니 연결', 'single', '1', '2', '19615', '2', NULL), 
  ('19691', '2023-04-10 19:53:41.489000', 'Y', 'Y', 'Y', '2023-04-10 19:53:41.489000', '카카오미니 사용법', 'process', '1', '2', '19615', '2', NULL), 
  ('19697', '2023-04-10 19:54:59.651000', 'Y', 'N', 'Y', '2023-04-10 19:54:59.651000', '헤이카카오 앱 사용법', 'single', '1', '2', '19615', '2', NULL), 
  ('19702', '2023-04-10 20:12:46.847000', 'Y', 'Y', 'Y', '2023-04-10 20:12:46.847000', '미니헥사 연결', 'process', '1', '2', '19615', '2', NULL), 
  ('19706', '2023-04-10 20:13:15.256000', 'Y', 'Y', 'Y', '2023-04-10 20:13:15.256000', '미니헥사 사용법', 'single', '1', '2', '19615', '2', NULL), 
  ('19718', '2023-04-10 20:25:23.509000', 'Y', 'Y', 'Y', '2023-04-10 20:25:23.509000', '미니링크 연결', 'process', '1', '2', '19615', '2', NULL), 
  ('19725', '2023-04-10 20:26:49.018000', 'Y', 'Y', 'Y', '2023-04-10 20:26:49.018000', '미니링크 사용법', 'process', '1', '2', '19615', '2', NULL), 
  ('19728', '2023-04-10 20:27:35.972000', 'Y', 'Y', 'Y', '2023-04-10 20:27:35.972000', '카카오워크에서 봇(Bot)이란 무엇인가요?', 'single', '1', '2', '19617', '2', NULL), 
  ('19730', '2023-04-10 20:28:24.077000', 'Y', 'Y', 'Y', '2023-04-10 20:28:24.077000', '구글 드라이브 파일을 멤버들에게 공유하고 싶어요.', 'single', '1', '2', '19617', '2', NULL), 
  ('19732', '2023-04-10 20:28:54.661000', 'Y', 'Y', 'Y', '2023-04-10 20:28:54.661000', 'Jira Enterprise Bot으로 어떤 기능을 이용할 수 있나요?', 'single', '1', '2', '19617', '2', NULL), 
  ('19734', '2023-04-10 20:29:20.186000', 'Y', 'Y', 'Y', '2023-04-10 20:29:20.186000', '내가 만든 Jira Enterprise Bot을 삭제하고 싶어요.', 'single', '1', '2', '19617', '2', NULL), 
  ('19736', '2023-04-10 20:29:42.997000', 'Y', 'Y', 'Y', '2023-04-10 20:29:42.997000', 'Jira Enterprise Bot을 만들어서 채팅방에 초대하고 싶어요.', 'single', '1', '2', '19617', '2', NULL), 
  ('19738', '2023-04-10 20:30:08.538000', 'Y', 'Y', 'Y', '2023-04-10 20:30:08.538000', 'Jira Enterprise에서 어떻게 설정해야 Webhook 알림을 받을 수 있나요?', 'single', '1', '2', '19617', '2', NULL), 
  ('19741', '2023-04-10 20:30:47.302000', 'Y', 'Y', 'Y', '2023-04-10 20:30:47.302000', 'GitHub Enterprise Bot으로 어떤 기능을 이용할 수 있나요?', 'single', '1', '2', '19617', '2', NULL), 
  ('19743', '2023-04-10 20:31:28.018000', 'Y', 'Y', 'Y', '2023-04-10 20:31:28.018000', 'GitHub Enterprise Bot을 만들어서 채팅방에 초대하고 싶어요.', 'single', '1', '2', '19617', '2', NULL), 
  ('19745', '2023-04-10 20:31:53.355000', 'Y', 'Y', 'Y', '2023-04-10 20:31:53.355000', '내가 만든 GitHub Enterprise Bot을 삭제하고 싶어요.', 'single', '1', '2', '19617', '2', NULL), 
  ('19749', '2023-04-10 20:32:34.405000', 'Y', 'Y', 'Y', '2023-04-10 20:32:34.405000', 'GitHub Enterprise에서 어떻게 설정해야 Webhook 알림을 받을 수 있나요?', 'single', '1', '2', '19617', '2', NULL), 
  ('19751', '2023-04-10 20:37:13.711000', 'Y', 'Y', 'Y', '2023-04-10 20:37:13.711000', '2차 인증이 무엇인지 궁금합니다.', 'single', '1', '2', '19616', '2', NULL), 
  ('19753', '2023-04-10 20:38:15.408000', 'Y', 'Y', 'Y', '2023-04-10 20:38:15.408000', '회원 정보를 수정 및 변경하는 방법이 궁금합니다.', 'process', '1', '2', '19616', '2', NULL), 
  ('19757', '2023-04-10 20:38:43.752000', 'Y', 'Y', 'Y', '2023-04-10 20:38:43.752000', '카카오 i 라스 서비스 및 가입 방법이 궁금합니다.', 'single', '1', '2', '19616', '2', NULL), 
  ('19759', '2023-04-10 20:39:07.341000', 'Y', 'Y', 'Y', '2023-04-10 20:39:07.341000', '카카오워크 등 다른 카카오 i 서비스에 가입한 계정으로 이용 가능한가요?', 'single', '1', '2', '19616', '2', NULL), 
  ('19761', '2023-04-10 20:39:34.896000', 'Y', 'Y', 'Y', '2023-04-10 20:39:34.896000', '휴대전화를 분실하거나 번호를 변경한 경우 2차 인증을 진행할 수 없나요?', 'single', '1', '2', '19616', '2', NULL), 
  ('19763', '2023-04-10 20:39:56.088000', 'Y', 'Y', 'Y', '2023-04-10 20:39:56.088000', '로그아웃을 하지 않았는데 로그아웃이 되었어요.', 'single', '1', '2', '19616', '2', NULL), 
  ('19765', '2023-04-10 20:40:15.047000', 'Y', 'Y', 'Y', '2023-04-10 20:40:15.047000', '탈퇴하고 싶어요.', 'single', '1', '2', '19616', '2', NULL), 
  ('19767', '2023-04-10 20:40:35.257000', 'Y', 'Y', 'Y', '2023-04-10 20:40:35.257000', '멤버를 초대하고 싶어요.', 'single', '1', '2', '19616', '2', NULL), 
  ('19771', '2023-04-10 20:41:11.601000', 'Y', 'Y', 'Y', '2023-04-10 20:41:11.601000', '일반 멤버로 가입하고 싶어요.', 'single', '1', '2', '19616', '2', NULL), 
  ('19773', '2023-04-10 20:47:35.884000', 'Y', 'Y', 'Y', '2023-04-10 20:47:35.884000', '회원 가입은 어떻게 하나요?', 'process', '1', '2', '19618', '2', NULL), 
  ('19781', '2023-04-10 20:48:40.721000', 'Y', 'Y', 'Y', '2023-04-10 20:48:40.721000', '콘솔 (console)을 사용하려면 어떻게 해야 하나요?', 'single', '1', '2', '19618', '2', NULL), 
  ('19783', '2023-04-10 20:50:04.993000', 'Y', 'Y', 'Y', '2023-04-10 20:50:04.993000', '프로젝트를 생성하려면 어떻게 해야 하나요?', 'process', '1', '2', '19618', '2', NULL), 
  ('19788', '2023-04-10 20:50:30.926000', 'Y', 'Y', 'Y', '2023-04-10 20:50:30.926000', '조직 계정에 사용자를 초대하려면 어떻게 해야 할까요?', 'single', '1', '2', '19618', '2', NULL), 
  ('19790', '2023-04-10 20:50:55.299000', 'Y', 'Y', 'Y', '2023-04-10 20:50:55.299000', '한 조직당 생성할 수 있는 프로젝트의 개수에 제한이 있나요?', 'single', '1', '2', '19618', '2', NULL), 
  ('19792', '2023-04-10 20:51:16.348000', 'Y', 'Y', 'Y', '2023-04-10 20:51:16.348000', '서비스 계정이 무엇인가요?', 'single', '1', '2', '19618', '2', NULL), 
  ('19796', '2023-04-10 20:52:54.159000', 'Y', 'Y', 'Y', '2023-04-10 20:52:54.159000', '사용자 액세스 키가 무엇이고 어떻게 발급받나요?', 'process', '1', '2', '19618', '2', NULL), 
  ('19800', '2023-04-10 20:53:21.968000', 'Y', 'Y', 'Y', '2023-04-10 20:53:21.968000', '사용자 액세스 키로 만든 인증 토큰의 만료 기한을 설정할 수 있나요?', 'single', '1', '2', '19618', '2', NULL), 
  ('19802', '2023-04-10 20:53:44.011000', 'Y', 'Y', 'Y', '2023-04-10 20:53:44.011000', '로그인 계정(이메일)과 비밀번호를 분실하였습니다. 확인 방법을 알고 싶어요.', 'single', '1', '2', '19618', '2', NULL), 
  ('19804', '2023-04-10 20:54:03.149000', 'Y', 'Y', 'Y', '2023-04-10 20:54:03.149000', '조직(도메인)이나 프로젝트를 삭제하려면 어떻게 해야 하나요?', 'single', '1', '2', '19618', '2', NULL), 
  ('19925', '2023-04-11 10:55:11.962000', 'Y', 'Y', 'Y', '2023-04-11 10:55:11.962000', '서비스 설명', 'single', '1', '2', '19613', '2', NULL), 
  ('19929', '2023-04-11 11:00:28.014000', 'Y', 'N', 'Y', '2023-04-11 11:00:28.014000', '기능 설명', 'process', '1', '2', '19613', '2', NULL);
UNLOCK TABLES;

