-- --------------------------------------------------------------
-- QueryPie Schema Export Script
-- https://www.querypie.com
--
-- Database: connectbranch
-- Generated At: 04/19/2023 04:55:18 +00:00
-- --------------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


CREATE TABLE `notice` (
  `id` bigint(20) NOT NULL COMMENT 'PK',
  `branch_id` varchar(100) COLLATE utf8mb4_bin DEFAULT NULL,
  `content` longtext COLLATE utf8mb4_bin COMMENT '공지사항 본문',
  `created` datetime(6) NOT NULL COMMENT '등록 시간',
  `creator` bigint(20) NOT NULL COMMENT '등록 유저 PK',
  `enabled` varchar(1) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '사용 여부',
  `fixation` varchar(1) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '상단 고정 여부',
  `modified` datetime(6) DEFAULT NULL COMMENT '수정 시간',
  `modifier` bigint(20) DEFAULT NULL COMMENT '수정 유저 PK',
  `open_type` varchar(10) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '오픈 범위(전체공개, 브랜치공개)',
  `title` varchar(500) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '공지사항 제목',
  `role_id` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '브랜치 PK',
  PRIMARY KEY (`id`),
  KEY `IDX_NOTICE__SEARCH_PORTAL` (`branch_id`,`open_type`,`fixation`,`created`),
  KEY `IDX_NOTICE__SEARCH_MANAGER` (`branch_id`,`fixation`,`created`),
  KEY `IDX_NOTICE__SEARCH_KEYWORD_MANAGER` (`branch_id`,`title`,`fixation`,`created`),
  KEY `IDX_NOTICE__SEARCH_KEYWORD_PORTAL` (`branch_id`,`open_type`,`title`,`fixation`,`created`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

LOCK TABLES notice WRITE;

INSERT INTO 
  notice (id, branch_id, content, created, creator, enabled, fixation, modified, modifier, open_type, title, role_id) 
VALUES 
  ('15714', ',1,15556,15986,16275,', '내용입니다', '2023-03-17 09:49:52.372000', '2', 'Y', '0', '2023-03-17 10:36:03.890000', '2', 'all', '제목입니다', ',1,2,3,'), 
  ('15721', ',1,15556,15986,16275,', '내용입니다', '2023-03-17 09:51:06.921000', '2', 'Y', '0', '2023-03-17 10:36:03.892000', '2', 'branch', '제목입니다', ',1,2,3,'), 
  ('15722', ',1,15556,15986,16275,', '내용입니다', '2023-03-17 09:51:22.532000', '2', 'Y', '0', '2023-03-17 10:36:03.894000', '2', 'all', '제목입니다', ',1,2,3,'), 
  ('16124', ',1,15556,15986,16275,', '내용입니다', '2023-03-17 16:59:01.753000', '3', 'N', '0', '2023-04-11 10:57:50.316000', '3', 'all', '제목입니다', ',1,2,3,'), 
  ('16764', ',1,15556,15986,16275,', '내용입니다', '2023-03-22 09:55:59.819000', '2', 'Y', '0', '2023-03-22 09:55:59.819000', NULL, 'all', '제목입니다', ',1,2,3,'), 
  ('16765', ',1,15556,15986,16275,', '내용입니다. 내용입니다. 하하하하하 음하하하하 테스트용 내용입니다. 이건 정말 긴 내용입니다. 아이고야 참 길다. 길어 길어 길어 길어 길어 길어 길어 길어 길어', '2023-03-23 16:53:07', '2', 'Y', '0', '2023-03-23 16:53:07', '2', 'all', '이건 정말 긴 내용을 한 번 확인해보기 위한 테스트 용이니 데이터는 지워주지 말아주세요.', ',1,2,3,'), 
  ('16766', ',1,15556,15986,16275,', '내용입니다.<br />내용입니다.<br />하하하하하 음하하하하 테스트용 내용입니다.<br />이건 정말 긴 내용입니다. 아이고야 참 길다. 길어 길어 길어 길어 길어 길어 길어 길어 길어', '2023-03-23 16:54:00', '2', 'Y', '0', '2023-03-23 16:54:00', '2', 'all', '이건 정말 긴 내용을 한 번 확인해보기 위한 테스트 용이니 데이터는 지워주지 말아주세요.', ',1,2,3,'), 
  ('16767', ',1,15556,15986,16275,', '내용입니다.<br />내용입니다.<br />하하하하하 음하하하하 테스트용 내용입니다.<br />이건 정말 긴 내용입니다. 아이고야 참 길다. 길어 길어 길어 길어 길어 길어 길어 길어 길어', '2023-03-23 16:54:00', '2', 'Y', '0', '2023-03-23 16:54:00', '2', 'all', '이건 정말 긴 내용을 한 번 확인해보기 위한 테스트 용이니 데이터는 지워주지 말아주세요.', ',1,2,3,'), 
  ('16768', ',1,15556,15986,16275,', '내용입니다.<br />내용입니다.<br />하하하하하 음하하하하 테스트용 내용입니다.<br />이건 정말 긴 내용입니다. 아이고야 참 길다. 길어 길어 길어 길어 길어 길어 길어 길어 길어', '2023-03-23 16:54:00', '2', 'Y', '0', '2023-03-23 16:54:00', '2', 'all', '이건 정말 긴 내용을 한 번 확인해보기 위한 테스트 용이니 데이터는 지워주지 말아주세요.', ',1,2,3,'), 
  ('16769', ',1,15556,15986,16275,', '내용입니다.<br />내용입니다.<br />하하하하하 음하하하하 테스트용 내용입니다.<br />이건 정말 긴 내용입니다. 아이고야 참 길다. 길어 길어 길어 길어 길어 길어 길어 길어 길어', '2023-03-23 16:54:00', '2', 'Y', '0', '2023-03-23 16:54:00', '2', 'all', '이건 정말 긴 내용을 한 번 확인해보기 위한 테스트 용이니 데이터는 지워주지 말아주세요.', ',1,2,3,'), 
  ('16770', ',1,15556,15986,16275,', '내용입니다.<br />내용입니다.<br />하하하하하 음하하하하 테스트용 내용입니다.<br />이건 정말 긴 내용입니다. 아이고야 참 길다. 길어 길어 길어 길어 길어 길어 길어 길어 길어', '2023-03-23 16:54:00', '2', 'Y', '0', '2023-03-23 16:54:00', '2', 'all', '이건 정말 긴 내용을 한 번 확인해보기 위한 테스트 용이니 데이터는 지워주지 말아주세요.', ',1,2,3,'), 
  ('16911', ',1,15556,15986,16275,', '내용입니다', '2023-03-24 12:34:35.507000', '2', 'Y', '0', '2023-03-24 12:34:35.507000', NULL, 'all', '제목입니다', ',1,2,3,'), 
  ('16912', ',1,15556,15986,16275,', '내용입니다', '2023-03-24 14:26:40.359000', '2', 'Y', '0', '2023-03-24 14:26:40.359000', NULL, 'all', '제목입니다', ',1,2,3,'), 
  ('16913', ',1,15556,15986,16275,', '내용입니다', '2023-03-24 14:26:40.359000', '2', 'Y', '0', '2023-03-24 14:26:40.359000', NULL, 'all', '다른제목테스트', ',1,2,3,'), 
  ('17254', ',1,15556,15986,16275,', '한글내용테55스트22222', '2023-03-29 10:08:06.937000', '2', 'Y', '0', '2023-03-29 10:08:06.937000', NULL, 'all', '한글테스트2553', ',1,2,3,'), 
  ('17258', ',1,15556,15986,16275,', '파일내용입니다.', '2023-03-29 10:51:22.544000', '3', 'Y', '0', '2023-03-29 10:51:22.544000', NULL, 'all', '파일테스트입니다.', ',1,2,3,'), 
  ('17262', ',1,15556,15986,16275,', '파일내용입니다.', '2023-03-29 10:58:22.105000', '3', 'Y', '0', '2023-03-29 10:58:22.105000', NULL, 'all', '파일테스트입니다.', ',1,2,3,'), 
  ('17265', ',1,15556,15986,16275,', '파일내용입니다.', '2023-03-29 11:02:10.502000', '3', 'Y', '0', '2023-03-29 11:02:10.502000', NULL, 'all', '파일테스트입니다.', ',1,2,3,'), 
  ('17268', ',1,15556,15986,16275,', '핑크한 키보드에용', '2023-03-29 12:41:59.611000', '2', 'Y', '0', '2023-03-29 12:41:59.611000', NULL, 'all', '키보드추천입니다.', ',1,2,3,'), 
  ('17311', ',1,15556,15986,16275,', '핑크한 키보드에용', '2023-03-29 13:39:00.841000', '2', 'Y', '0', '2023-03-29 13:39:00.841000', NULL, 'all', '키보드추천입니다.', ',1,2,3,'), 
  ('17509', ',1,15556,15986,16275,', '파일테', '2023-03-29 16:37:01.961000', '2', 'Y', '0', '2023-03-29 16:37:01.961000', NULL, 'all', '파일테스트입니다.', ',1,2,3,'), 
  ('17522', ',1,15556,15986,16275,', '핑크한 키보드에용', '2023-03-29 16:41:16.849000', '2', 'Y', '0', '2023-03-29 16:41:16.849000', NULL, 'all', '키보드추천1111입니다.', ',1,2,3,'), 
  ('17652', ',1,15556,15986,16275,', '으라차차차차다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다다중파일테스트입니다', '2023-03-30 11:10:13.031000', '3', 'N', '0', '2023-04-11 10:57:56.716000', '3', 'all', '다중파일테스트입니다', ',1,2,3,'), 
  ('17709', ',1,15556,15986,16275,', '3개용', '2023-03-30 13:38:17.332000', '2', 'Y', 'N', '2023-03-30 13:38:17.332000', NULL, 'all', '다중파일입니다.', ',1,2,3,'), 
  ('17723', ',1,15556,15986,16275,', '2개용', '2023-03-30 13:59:31.010000', '2', 'Y', 'N', '2023-03-30 13:59:31.010000', NULL, 'all', '압축 및 문서파일입니다.', ',1,2,3,'), 
  ('17858', ',1,15556,15986,16275,', '@#$@#$', '2023-03-31 10:13:19.616000', '3', 'N', 'N', '2023-04-11 10:57:56.713000', '3', 'all', '!@#$#', ',1,2,3,'), 
  ('17859', ',1,15556,15986,16275,', '!!!!!', '2023-03-31 10:13:26.549000', '3', 'N', 'N', '2023-04-11 10:57:56.711000', '3', 'all', '?????', ',1,2,3,'), 
  ('17860', ',1,15556,15986,16275,', '44444', '2023-03-31 10:13:35.170000', '3', 'N', 'N', '2023-04-11 10:57:56.709000', '3', 'all', '333523*&*&*&', ',1,2,3,'), 
  ('17861', ',1,15556,15986,16275,', '44444', '2023-03-31 10:16:47.087000', '3', 'N', 'N', '2023-04-11 10:57:56.707000', '3', 'all', 'hellow', ',1,2,3,'), 
  ('17862', ',1,15556,15986,16275,', '44444', '2023-03-31 10:16:54.908000', '3', 'N', 'N', '2023-04-11 10:57:56.704000', '3', 'all', 'what?!', ',1,2,3,'), 
  ('17931', ',1,15556,15986,16275,', '테스트입니다', '2023-03-31 17:12:56.428000', '3', 'Y', 'N', '2023-03-31 17:12:56.428000', NULL, 'all', '호호호호호', ',1,2,3,'), 
  ('17956', ',1,15556,15986,16275,', '새로 등록한 공지사항 테스트', '2023-04-03 09:04:44.488000', '3', 'Y', 'N', '2023-04-03 09:04:44.488000', NULL, 'all', '새로 등록한 공지사항 테스트', ',1,2,3,'), 
  ('17974', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-03 13:06:20.174000', '3', 'Y', 'N', '2023-04-03 13:06:20.174000', NULL, 'all', '가나다', ',1,2,3,'), 
  ('18000', ',1,15556,15986,16275,', '파일내용입니다.', '2023-03-29 10:51:22.544000', '3', 'Y', '0', '2023-03-29 10:51:22.544000', NULL, 'all', '파일테스트입니다.', ',1,2,3,'), 
  ('18001', ',1,15556,15986,16275,', '내용입니다', '2023-03-24 12:34:35.507000', '2', 'Y', '0', '2023-03-24 12:34:35.507000', NULL, 'all', '제목입니다', ',1,2,3,'), 
  ('18002', ',1,15556,15986,16275,', '핑크한 키보드에용', '2023-03-29 12:41:59.611000', '2', 'Y', '0', '2023-03-29 12:41:59.611000', NULL, 'all', '키보드추천입니다.', ',1,2,3,'), 
  ('18055', ',1,15556,15986,16275,', '왜... 무엇 때문에...왜... 무엇 때문에...왜... 무엇 때문에...왜... 무엇 때문에...왜... 무엇 때문에...', '2023-04-03 16:10:54.979000', '3', 'Y', 'N', '2023-04-03 16:10:54.979000', NULL, 'all', '왜... 무엇 때문에...', ',1,2,3,'), 
  ('18059', ',1,15556,15986,16275,', '호호', '2023-04-03 16:49:42.442000', '3', 'Y', 'N', '2023-04-03 16:49:42.442000', NULL, 'all', '하하하하 이얍! 덤벼랏!', ',1,2,3,'), 
  ('18060', ',1,15556,15986,16275,', '오늘은 매우 즐거운 날', '2023-04-03 16:49:54.646000', '3', 'Y', 'N', '2023-04-03 16:49:54.646000', NULL, 'all', 'ㅜㅜ', ',1,2,3,'), 
  ('18288', ',1,15556,15986,16275,', '새 공지사항', '2023-04-04 08:33:52.159000', '3', 'Y', 'N', '2023-04-04 08:33:52.159000', NULL, 'all', '새 공지사항', ',1,2,3,'), 
  ('18289', ',1,15556,15986,16275,', '제목제목제목제목', '2023-04-04 09:30:56.781000', '3', 'Y', 'N', '2023-04-04 09:30:56.781000', NULL, 'all', '제목', ',1,2,3,'), 
  ('18290', ',1,15556,15986,16275,', '이건제목', '2023-04-04 09:31:02.291000', '3', 'N', 'N', '2023-04-11 15:20:23.533000', '3', 'all', '이건제목', ',1,2,3,'), 
  ('18291', ',1,15556,15986,16275,', '제목 용 페이지네이션 체크 데이터', '2023-04-04 09:31:12.711000', '3', 'N', 'N', '2023-04-11 15:20:23.530000', '3', 'all', '제목 용 페이지네이션 체크 데이터', ',1,2,3,'), 
  ('18292', ',1,15556,15986,16275,', '제목목목목!
<br />
<br />
<br />wpahr
<br />wpahr
<br />
<br />
<br />
<br />asdf
<br />
<br />wpahr
<br />wparh
<br />waphr
<br />
<br />safgasdfasdfasd
<br />
<br />
<br />wpahr', '2023-04-04 09:31:23.258000', '3', 'N', 'N', '2023-04-11 10:58:08.427000', '3', 'all', '제목목목목!', ',1,2,3,'), 
  ('18293', ',1,15556,15986,16275,', '서치서치 제목제목 히히<br /><br />ggl<br /><br />asdf<br /><br />asdgasdf<br />asdfasdf<br /><br /><br />awergasfgasdrf', '2023-04-04 09:31:30.616000', '3', 'N', 'N', '2023-04-11 10:58:08.424000', '3', 'all', '서치서치 제목제목 히히', ',1,2,3,'), 
  ('18444', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-04 14:52:38.536000', '15565', 'Y', 'N', '2023-04-04 14:52:38.536000', NULL, 'all', '매니저2가 쓴 공지사항', ',1,2,3,'), 
  ('18445', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-04 14:52:40.678000', '15565', 'Y', 'N', '2023-04-04 14:52:40.678000', NULL, 'all', '매니저2가 쓴 공지사항2', ',1,2,3,'), 
  ('18446', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-04 14:52:42.251000', '15565', 'Y', 'N', '2023-04-04 14:52:42.251000', NULL, 'all', '매니저2가 쓴 공지사항23', ',1,2,3,'), 
  ('18447', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-04 14:52:43.533000', '15565', 'Y', 'N', '2023-04-04 14:52:43.533000', NULL, 'all', '매니저2가 쓴 공지사항234', ',1,2,3,'), 
  ('18448', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-04 14:52:45.175000', '15565', 'Y', 'N', '2023-04-04 14:52:45.175000', NULL, 'all', '매니저2가 쓴 공지사항2345', ',1,2,3,'), 
  ('18449', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-04 15:07:07.128000', '15565', 'Y', 'N', '2023-04-04 15:07:07.128000', NULL, 'all', '긴 제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트긴제목테스트', ',1,2,3,'), 
  ('18776', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다', '2023-04-05 16:04:40.825000', '15565', 'Y', 'N', '2023-04-05 16:04:40.825000', NULL, 'all', '설마? 설마 설마 설마 긴 제목 테스트 테스트 설마 설마 설마 설마 설마트 설마 설마 설마 설마 설마트 설마 설마 설마 설마 설마', ',1,2,3,'), 
  ('19005', ',1,15556,15986,16275,', '가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다



가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다



가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다



가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다가나다



', '2023-04-06 12:33:00.254000', '15565', 'Y', 'N', '2023-04-10 20:33:24.868000', '3', 'all', '가나다', ',1,2,3,'), 
  ('19113', ',1,15556,15986,16275,', '1312312', '2023-04-06 19:22:42.489000', '3', 'N', 'N', '2023-04-10 20:30:15.761000', '3', NULL, '313123', ',1,2,3,'), 
  ('19114', ',1,15556,15986,16275,', '1', '2023-04-06 19:25:15.045000', '3', 'N', 'N', '2023-04-10 20:30:15.760000', '3', 'all', '1', ',1,2,3,'), 
  ('19115', ',1,15556,15986,16275,', '1', '2023-04-06 19:25:54.046000', '3', 'N', 'N', '2023-04-10 20:30:15.758000', '3', 'all', '1', ',1,2,3,'), 
  ('19123', ',1,15556,15986,16275,', '4', '2023-04-06 19:37:12.080000', '3', 'N', 'N', '2023-04-10 20:30:15.756000', '3', 'all', '4', ',1,2,3,'), 
  ('19161', ',1,15556,15986,16275,', '공지사항 등록에서 파일 업로드! 뿅!', '2023-04-06 19:55:31.897000', '3', 'N', 'N', '2023-04-10 20:30:15.754000', '3', 'all', '공지사항 등록에서 파일 업로드! 뿅!', ',1,2,3,'), 
  ('19162', ',1,15556,15986,16275,', '  SET_NEW_NOTICE_FORM_DATA(state, payload) {<br />    state.newNoticeFormData= payload<br />  }', '2023-04-06 20:15:20.263000', '3', 'N', 'N', '2023-04-10 20:30:15.752000', '3', 'all', '테[스트', ',1,2,3,'), 
  ('19163', ',1,15556,15986,16275,', '  SET_NEW_NOTICE_FORM_DATA(state, payload) {<br />    state.newNoticeFormData= payload<br />  }', '2023-04-06 20:15:21.945000', '3', 'N', 'N', '2023-04-10 20:30:15.750000', '3', 'all', '테[스트', ',1,2,3,'), 
  ('19164', ',1,15556,15986,16275,', 'test', '2023-04-06 20:46:40.078000', '3', 'N', 'N', '2023-04-10 20:30:15.749000', '3', 'all', 'test', ',1,2,3,'), 
  ('19165', ',1,15556,15986,16275,', 'hahaha', '2023-04-06 20:47:33.679000', '3', 'N', 'N', '2023-04-10 20:30:15.745000', '3', 'all', 'hahaha', ',1,2,3,'), 
  ('19166', ',1,15556,15986,16275,', 'w', '2023-04-06 20:49:46.814000', '3', 'N', 'N', '2023-04-10 20:25:18.161000', '3', 'all', 'w', ',1,2,3,'), 
  ('19167', ',1,15556,15986,16275,', 'sdfsdf', '2023-04-06 20:53:33.978000', '3', 'N', 'N', '2023-04-10 20:25:18.157000', '3', 'all', 'sdfsdf', ',1,2,3,'), 
  ('19248', ',1,15556,15986,16275,', '2개다', '2023-04-07 15:12:56.761000', '3', 'N', 'N', '2023-04-10 20:25:18.154000', '3', 'all', '브랜치 역할 테스트', ',1,2,'), 
  ('19250', ',1,15556,15986,16275,', '2개다', '2023-04-07 15:18:19.726000', '3', 'N', 'N', '2023-04-10 20:25:18.150000', '3', 'all', '파일테스트 2개임', ',1,2,'), 
  ('19275', ',2,3,', '2개다', '2023-04-07 17:23:10.422000', '3', 'Y', 'N', '2023-04-07 17:23:10.422000', NULL, 'all', '브랜치 역할 테스트', ',1,2,'), 
  ('19276', ',1,', '1', '2023-04-07 17:25:57.533000', '3', 'Y', 'N', '2023-04-07 17:25:57.533000', NULL, 'all', '1', ',1,'), 
  ('19277', ',1,15556,15986,16275,', '12', '2023-04-07 17:26:38.972000', '3', 'N', 'N', '2023-04-10 20:25:18.144000', '3', 'all', '12', ',1,2,3,4,'), 
  ('19278', ',15986,16275,', 'test', '2023-04-07 17:28:38.950000', '3', 'Y', 'N', '2023-04-07 17:28:38.950000', NULL, 'all', 'test', ',2,'), 
  ('19279', ',15556,16275,', 'test', '2023-04-07 17:29:36.919000', '3', 'Y', 'N', '2023-04-07 17:29:36.919000', NULL, 'all', 'test', ',1,2,'), 
  ('19280', ',15556,16275,', 'test', '2023-04-07 17:29:58.434000', '3', 'Y', 'N', '2023-04-07 17:29:58.434000', NULL, 'all', 'test', ',2,4,'), 
  ('19281', ',1,15556,15986,16275,', 'tw', '2023-04-07 17:30:14.899000', '3', 'N', 'N', '2023-04-10 20:25:18.142000', '3', 'all', 'tw', ',1,2,3,4,'), 
  ('19282', ',1,', 't', '2023-04-07 17:30:32.378000', '3', 'Y', 'N', '2023-04-07 17:30:32.378000', NULL, 'all', 't', ',1,'), 
  ('19283', ',1,15556,', 'r', '2023-04-07 17:30:40.144000', '3', 'N', 'N', '2023-04-10 20:25:18.139000', '3', 'all', 'r', ',2,'), 
  ('19284', ',15986,', 'test', '2023-04-07 17:31:10.481000', '3', 'Y', 'N', '2023-04-07 17:31:10.481000', NULL, 'all', 'test', ',2,'), 
  ('19285', ',1,', 'ert', '2023-04-07 17:31:20.205000', '3', 'N', 'N', '2023-04-10 20:25:18.137000', '3', 'all', '54555', ',2,'), 
  ('19286', ',1,', '555', '2023-04-07 17:32:19.521000', '3', 'N', 'N', '2023-04-10 20:25:18.135000', '3', 'all', '555', ',2,'), 
  ('19287', ',1,', 'qqq', '2023-04-07 17:32:54.599000', '3', 'N', 'N', '2023-04-10 20:25:18.132000', '3', 'all', 'qqq', ',2,'), 
  ('19288', ',1,', '123', '2023-04-07 17:33:30.199000', '3', 'N', 'N', '2023-04-10 20:25:14.585000', '3', 'all', '123', ',2,'), 
  ('19289', ',1,15556,', 'sdf', '2023-04-07 17:34:24.121000', '3', 'N', 'N', '2023-04-10 20:25:14.582000', '3', 'all', 'sdf', ',1,2,'), 
  ('19290', ',1,', '55', '2023-04-07 17:35:39.166000', '3', 'N', 'N', '2023-04-10 20:25:14.580000', '3', 'all', '55', ',2,'), 
  ('19291', ',1,', 'hedfg', '2023-04-07 17:36:03.727000', '3', 'N', 'N', '2023-04-10 20:25:14.579000', '3', 'all', 'sdf', ',2,'), 
  ('19292', ',1,', 'ht', '2023-04-07 17:37:21.068000', '3', 'N', 'N', '2023-04-10 20:25:14.577000', '3', 'all', 'th', ',2,'), 
  ('19293', ',1,', 'sdf', '2023-04-07 17:38:11.030000', '3', 'N', 'N', '2023-04-10 20:25:14.575000', '3', 'all', 'sdf', ',2,'), 
  ('19294', ',1,', '11', '2023-04-07 17:38:26.935000', '3', 'N', 'N', '2023-04-10 20:25:14.573000', '3', 'all', '11', ',2,'), 
  ('19295', ',1,15556,15986,16275,', 'test', '2023-04-07 17:39:39.361000', '3', 'N', 'N', '2023-04-10 20:25:14.571000', '3', 'all', 'test', ',1,2,3,4,'), 
  ('19296', ',1,', 'test', '2023-04-07 17:58:26.661000', '3', 'N', 'N', '2023-04-10 20:25:14.569000', '3', 'all', 'test', ',2,'), 
  ('19297', ',1,', 'ㄴ', '2023-04-07 17:58:51.060000', '3', 'N', 'N', '2023-04-10 20:25:14.566000', '3', 'all', 'ㄴ', ',2,'), 
  ('19298', ',1,', 'ㅁㄴㅇㄹ', '2023-04-07 17:59:49.796000', '3', 'N', 'N', '2023-04-10 20:24:35.351000', '3', 'all', 'ㅁㄴㅇㄹ', ',2,'), 
  ('19299', ',1,15556,', 'ㅁㄴㅇㄹ9999', '2023-04-07 18:00:27.898000', '3', 'N', 'N', '2023-04-10 20:24:35.349000', '3', 'all', '99999ㅁㄴㅇㄹ', ',1,2,'), 
  ('19300', ',1,15556,', 'ㅁㄴㅇㄹ9999', '2023-04-07 18:01:11.914000', '3', 'N', 'N', '2023-04-10 20:24:35.346000', '3', 'all', '99999ㅁㄴㅇㄹ', ',1,2,'), 
  ('19301', ',1,15556,', 'ㅁㄴㅇㄹ9999ger', '2023-04-07 18:01:21.771000', '3', 'N', 'N', '2023-04-10 20:24:35.344000', '3', 'all', '99999ㅁㄴㅇㄹger', ',1,2,'), 
  ('19302', ',1,', '666', '2023-04-07 18:02:19.572000', '3', 'N', 'N', '2023-04-10 20:24:35.341000', '3', 'all', '666', ',2,'), 
  ('19303', ',1,15556,', '666', '2023-04-07 18:02:25.630000', '3', 'N', 'N', '2023-04-10 20:24:35.339000', '3', 'all', '666', ',1,2,'), 
  ('19304', ',1,15556,', '666', '2023-04-07 18:10:12.116000', '3', 'N', 'N', '2023-04-10 20:24:35.337000', '3', 'all', '666', ',1,2,'), 
  ('19305', ',1,15556,', '666', '2023-04-07 18:10:58.475000', '3', 'N', 'N', '2023-04-10 20:24:35.335000', '3', 'all', '666', ',1,2,'), 
  ('19306', ',1,15556,', 'ㅁㄴㅇㄹ9999', '2023-04-07 18:12:17.111000', '3', 'N', 'N', '2023-04-10 20:24:35.332000', '3', 'all', '99999ㅁㄴㅇㄹ', ',1,2,'), 
  ('19307', ',1,15556,', 'ㅁㄴㅇㄹ9999', '2023-04-07 18:12:47.986000', '3', 'N', 'N', '2023-04-10 20:24:35.330000', '3', 'all', '99999ㅁㄴㅇㄹ', ',1,2,'), 
  ('19308', ',1,15556,', 'ㅁㄴㅇㄹ9999', '2023-04-07 18:12:50.861000', '3', 'N', 'N', '2023-04-10 20:23:57.904000', '3', 'all', '99999ㅁㄴㅇㄹ', ',1,2,'), 
  ('19309', ',1,15556,', 'ㅁㄴㅇㄹ9999', '2023-04-07 18:43:29.215000', '3', 'N', 'N', '2023-04-10 20:23:57.901000', '3', 'all', '99999ㅁㄴㅇㄹ222', ',1,2,'), 
  ('19310', ',1,15556,', '666hhh<br /><br />yuilkfu<br />8iuo;p<br />7y8oyuio', '2023-04-07 18:43:43.736000', '3', 'N', 'N', '2023-04-10 20:23:57.899000', '3', 'all', '666hhhhh', ',1,2,'), 
  ('19311', ',1,', 'test', '2023-04-07 18:45:52.811000', '3', 'N', 'N', '2023-04-10 20:23:57.896000', '3', 'all', 'test', ',2,'), 
  ('19312', ',1,', 'tre', '2023-04-07 18:46:35.763000', '3', 'N', 'N', '2023-04-10 20:23:57.893000', '3', 'all', 'tre', ',2,'), 
  ('19313', ',1,', 't', '2023-04-07 18:47:32.512000', '3', 'N', 'N', '2023-04-10 20:23:57.891000', '3', 'all', 't', ',2,'), 
  ('19314', ',1,16275,', 'tss', '2023-04-07 18:47:44.156000', '3', 'N', 'N', '2023-04-10 20:23:57.887000', '3', 'all', 'tss', ',2,4,'), 
  ('19315', ',1,', 'asd', '2023-04-07 18:48:36.062000', '3', 'N', 'N', '2023-04-10 20:23:57.883000', '3', 'all', 'asd', ',2,'), 
  ('19316', ',1,15556,', 'asdfds', '2023-04-07 18:48:44.358000', '3', 'N', 'N', '2023-04-10 20:23:57.880000', '3', 'all', 'asdfds', ',1,2,'), 
  ('19317', ',1,', '.', '2023-04-07 18:49:47.629000', '3', 'N', 'N', '2023-04-10 20:23:57.874000', '3', 'all', '하하', ',2,'), 
  ('19318', ',1,15556,', '.', '2023-04-07 18:49:54.714000', '3', 'N', 'N', '2023-04-10 20:09:39.537000', '3', 'all', '하하헤헤', ',1,2,'), 
  ('19319', ',1,', '.', '2023-04-07 18:50:36.166000', '3', 'N', 'N', '2023-04-10 20:09:39.534000', '3', 'all', '오잉', ',2,'), 
  ('19320', ',1,', '.', '2023-04-07 18:50:41.267000', '3', 'N', 'N', '2023-04-10 20:09:39.532000', '3', 'all', '오잉양양', ',2,'), 
  ('19396', ',2,3,', '내용', '2023-04-10 09:49:13.750000', '2', 'Y', 'N', '2023-04-10 09:49:13.750000', NULL, 'all', '등록테스트', ',1,2,'), 
  ('19397', ',1,15556,15986,16275,', 'ㅁㄴㅇㄹ', '2023-04-10 09:49:27.005000', '3', 'N', 'N', '2023-04-10 20:09:39.530000', '3', 'all', 'ㅁㄴㅇㄹ', ',1,2,3,4,'), 
  ('19398', ',1,15556,', '34', '2023-04-10 09:52:01.362000', '3', 'N', 'N', '2023-04-10 20:09:39.528000', '3', 'all', '344', ',2,'), 
  ('19399', ',1,15556,15986,16275,', '123', '2023-04-10 09:55:40.543000', '3', 'N', 'N', '2023-04-10 20:09:39.526000', '3', 'all', '123', ',1,2,3,4,'), 
  ('19419', ',1,', 'wet', '2023-04-10 10:36:43.277000', '3', 'N', 'N', '2023-04-10 20:09:39.523000', '3', 'all', 'wet', ',2,'), 
  ('19440', ',1,', '123123', '2023-04-10 10:55:01.436000', '3', 'N', 'N', '2023-04-10 20:09:39.521000', '3', 'all', '123', ',2,'), 
  ('19472', ',1,', 'test', '2023-04-10 13:06:58.982000', '3', 'N', 'N', '2023-04-10 20:09:39.519000', '3', 'all', 'test', ',2,'), 
  ('19473', ',1,', 'test11', '2023-04-10 13:07:14.208000', '3', 'N', 'N', '2023-04-10 20:09:39.517000', '3', 'all', 'test11', ',2,'), 
  ('19474', ',1,15556,15986,16275,', 'tt', '2023-04-10 13:14:08.782000', '3', 'N', 'N', '2023-04-10 20:09:04.860000', '3', 'all', 'tt', ',1,2,3,4,'), 
  ('19475', ',1,15556,15986,16275,', 'hehe', '2023-04-10 13:15:32.673000', '3', 'N', 'N', '2023-04-10 20:09:04.857000', '3', 'all', 'hehe', ',1,2,3,4,'), 
  ('19476', ',1,15556,15986,16275,', '공지사항 등록 테스트(라우트)', '2023-04-10 13:16:25.235000', '3', 'N', 'N', '2023-04-10 20:09:04.855000', '3', 'all', '공지사항 등록 테스트(라우트)', ',1,2,3,4,'), 
  ('19477', ',1,', 'hhelo<br /><br />haha routingtingtingtingtingtingtingtingtin<br /><br />hahaha<br /><br />heheheh<br /><br /><br /><br /><br />hehehe<br />check it out, yo!', '2023-04-10 13:17:25.751000', '3', 'N', 'N', '2023-04-10 20:09:04.852000', '3', 'all', 'haha routingtingtingtingtingtingtingtingtin', ',2,'), 
  ('19478', ',1,', 'test', '2023-04-10 13:17:59.054000', '3', 'N', 'N', '2023-04-10 20:09:04.850000', '3', 'all', 'test', ',2,'), 
  ('19479', ',1,15556,15986,16275,', 'test', '2023-04-10 13:18:11.959000', '3', 'N', 'N', '2023-04-10 20:09:04.848000', '3', 'all', 'test', ',1,2,3,4,'), 
  ('19480', ',1,15556,15986,16275,', 'ㅁㄴㅇㄹ', '2023-04-10 13:24:28.879000', '3', 'N', 'N', '2023-04-10 20:09:04.845000', '3', 'all', '라우터 ... 후...', ',1,2,3,4,'), 
  ('19481', ',1,15556,15986,16275,', '긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트<br />긴 글 테스트긴 글 테스트긴 글 테스트<br />긴 글 테스트긴 글 테스트긴 글 테스트<br /><br /><br />긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트<br />긴 글 테스트긴 글 테스트긴 글 테스트<br />긴 글 테스트긴 글 테스트긴 글 테스트<br /><br /><br />긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트<br /><br />긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트<br />긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트<br />긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트<br /><br /><br />긴 글 테스트긴 글 테스트긴 글 테스트<br /><br /><br />긴 글 테스트긴 글 테스트긴 글 테스트<br /><br />긴 글 테스트<br />긴 글 테스트긴 글 테스트긴 글 테스트<br /><br />긴 글 테스트긴 글 테스트긴 글 테스트<br /><br /><br />긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트긴 글 테스트', '2023-04-10 13:25:07.270000', '3', 'N', 'N', '2023-04-10 20:09:04.843000', '3', 'all', '긴 글 테스트', ',1,2,3,4,'), 
  ('19482', ',1,15556,', '힣gpgp', '2023-04-10 13:53:51.142000', '3', 'N', 'N', '2023-04-10 20:09:04.841000', '3', 'all', '힣gpgp', ',1,2,'), 
  ('19550', ',1,15556,15986,16275,', 'ㅅㄷㄴㅅㅇㅇㅇ', '2023-04-10 15:46:16.887000', '3', 'N', 'N', '2023-04-10 20:09:04.838000', '3', 'all', 'ㅅㄷㅇㅇㅇ', ',1,2,3,4,'), 
  ('19551', ',1,15556,15986,16275,', 'asdf', '2023-04-10 16:17:52.774000', '3', 'N', 'N', '2023-04-10 20:07:20.072000', '3', 'all', 'asdf', ',1,2,3,4,'), 
  ('19552', ',15556,', '123', '2023-04-10 16:18:23.161000', '3', 'Y', 'N', '2023-04-10 19:08:02.063000', '3', 'all', '123', ',2,'), 
  ('19553', ',1,15556,15986,16275,', 'gggg', '2023-04-10 16:19:07.407000', '3', 'N', 'N', '2023-04-10 20:07:20.070000', '3', 'all', 'ttt', ',1,2,3,4,'), 
  ('19554', ',1,', '555876543', '2023-04-10 16:20:14.318000', '3', 'N', 'N', '2023-04-10 20:07:20.067000', '3', 'all', '5559876543', ',2,'), 
  ('19555', ',15556,', '234', '2023-04-10 16:20:20.422000', '3', 'Y', 'N', '2023-04-10 16:20:20.422000', NULL, 'all', '234', ',1,2,'), 
  ('19556', ',1,', '????___', '2023-04-10 16:20:26.907000', '3', 'N', 'N', '2023-04-10 20:07:20.065000', '3', 'all', '123', ',2,'), 
  ('19597', ',1,15556,15986,16275,', '????___', '2023-04-10 16:40:13.149000', '3', 'N', 'N', '2023-04-10 20:07:20.062000', '3', 'all', 'hjgkfdghkfghjkfghjkfghjk', ',1,2,3,4,'), 
  ('19598', ',1,15556,', 'ㅅㄷㄴㅅwerasdfasdfasdf', '2023-04-10 16:41:49.011000', '3', 'N', 'N', '2023-04-10 20:07:20.060000', '3', 'all', 'wqerㅅㄷㄴㅅasdfasdf', ',1,2,'), 
  ('19605', ',1,15556,15986,16275,', '12309876543', '2023-04-10 16:42:44.930000', '3', 'N', 'N', '2023-04-10 20:07:20.058000', '3', 'all', '1230987654', ',1,2,3,4,'), 
  ('19638', ',1,15556,15986,16275,', 'test888', '2023-04-10 17:22:09.572000', '3', 'N', 'N', '2023-04-10 20:07:20.055000', '3', 'all', 'test888', ',1,2,3,4,'), 
  ('19639', ',1,16275,', 'poiuytrew', '2023-04-10 17:23:40.120000', '3', 'N', 'N', '2023-04-10 20:07:20.053000', '3', 'all', 'test1', ',1,2,4,'), 
  ('19682', ',1,15556,15986,16275,', 'fsdf', '2023-04-10 19:26:15.409000', '3', 'N', 'N', '2023-04-10 20:07:20.048000', '3', 'all', 'fsdd', ',1,2,3,4,'), 
  ('19683', ',1,', 'rrr', '2023-04-10 19:26:27.905000', '3', 'N', 'N', '2023-04-10 20:07:04.772000', '3', 'all', 'rrr', ',2,'), 
  ('19684', ',1,15556,15986,16275,', '12344442222', '2023-04-10 19:28:36.897000', '3', 'N', 'N', '2023-04-10 20:07:04.767000', '3', 'all', '222123444', ',1,2,3,4,'), 
  ('19688', ',1,15556,16275,', '0000', '2023-04-10 19:40:56.882000', '3', 'N', 'N', '2023-04-10 20:05:55.948000', '3', 'all', '0000', ',1,2,4,'), 
  ('19699', ',1,', 'test1111', '2023-04-10 20:00:54.079000', '3', 'N', 'N', '2023-04-10 20:05:09.277000', '3', 'all', 'test11111', ',2,'), 
  ('19812', ',1,15556,15986,16275,', 'test', '2023-04-11 08:46:38.569000', '3', 'N', 'N', '2023-04-11 10:57:42.248000', '3', 'all', 'test', ',1,2,3,4,'), 
  ('19813', ',1,15556,15986,16275,', 'test', '2023-04-11 08:48:42.953000', '3', 'N', 'N', '2023-04-11 10:57:42.246000', '3', 'all', 'test', ',1,2,3,4,'), 
  ('19814', ',1,', 'test', '2023-04-11 08:49:12.387000', '3', 'N', 'N', '2023-04-11 10:57:42.245000', '3', 'all', 'test', ',1,2,'), 
  ('19815', ',1,15556,15986,16275,', 'ㅅㄷㄴㅅ', '2023-04-11 08:56:21.210000', '3', 'N', 'N', '2023-04-11 10:57:42.243000', '3', 'all', 'ㅅㄷㄴㅅ', ',1,2,3,4,'), 
  ('19832', ',1,15556,15986,16275,', 'test', '2023-04-11 09:17:41.871000', '3', 'N', 'N', '2023-04-11 10:57:42.222000', '3', 'all', 'test', ',1,2,3,4,'), 
  ('19947', ',1,15556,15986,16275,', 'test', '2023-04-11 15:31:26.718000', '3', 'N', 'N', '2023-04-12 09:15:02.271000', '3', 'all', 'test', ',1,2,3,4,'), 
  ('19948', ',1,', 'tttttasdasdasdasdfgasfg', '2023-04-11 15:31:34.687000', '3', 'Y', 'N', '2023-04-12 09:15:07.161000', '3', 'all', 'ttteragsdfg', ',1,2,'), 
  ('19949', ',1,15556,', '13', '2023-04-11 15:31:41.976000', '3', 'Y', 'N', '2023-04-12 09:23:03.471000', '3', 'all', '1ye3213', ',1,2,'), 
  ('20078', ',1,16275,', '1kkkkkk2', '2023-04-12 09:09:45.430000', '3', 'Y', 'N', '2023-04-12 09:22:16.869000', '3', 'all', 'iiii21432', ',2,4,'), 
  ('20081', ',1,15556,15986,16275,', 'twet678678', '2023-04-12 09:59:02.727000', '3', 'Y', 'N', '2023-04-12 09:59:13.956000', '3', 'all', 'twert75678-098765', ',1,2,3,4,'), 
  ('20307', ',1,15556,15986,16275,', 'asdf', '2023-04-13 10:45:03.128000', '3', 'Y', 'N', NULL, NULL, 'all', 'asdf', ',1,2,3,4,'), 
  ('20381', ',1,15556,15986,16275,', 'ertertert', '2023-04-14 08:56:04.702000', '3', 'Y', 'N', '2023-04-14 08:56:04.702000', NULL, 'all', 'ertert', ',1,2,3,4,'), 
  ('20382', ',1,', '이걸로 테스트 하시면 됩니다.', '2023-04-14 08:56:13.999000', '3', 'Y', 'N', '2023-04-14 08:56:13.999000', NULL, 'all', '이걸로 테스트 하시면 됩니다.', ',1,2,'), 
  ('20383', ',1,15556,15986,16275,', '테스트용 공지사항 1', '2023-04-14 08:56:25.028000', '3', 'Y', 'N', '2023-04-14 08:56:25.028000', NULL, 'all', '테스트용 공지사항 1', ',1,2,3,4,'), 
  ('20384', ',1,', '테스트용 공지사항 2', '2023-04-14 08:56:31.902000', '3', 'Y', 'N', '2023-04-14 08:56:31.902000', NULL, 'all', '테스트용 공지사항 2', ',2,'), 
  ('20385', ',1,15556,', '테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용<br />테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용<br /><br />테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용테스트용 공지사항 3 긴 내용', '2023-04-14 08:56:57.267000', '3', 'Y', 'N', '2023-04-14 08:58:11.900000', '3', 'all', '테스트용 공지사항 3 긴 내용', ',2,3,'), 
  ('20386', ',1,15556,', '테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4<br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4<br /><br /><br />테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4테스트용 공지사항 긴 내용 4', '2023-04-14 08:58:36.284000', '3', 'Y', 'N', '2023-04-14 08:58:36.284000', NULL, 'all', '테스트용 공지사항 긴 내용 4', ',1,2,4,'), 
  ('20543', ',1,15556,15986,16275,', 'qwerwqer', '2023-04-17 08:50:08.945000', '3', 'N', 'N', '2023-04-17 09:04:44.806000', '3', 'all', 'wqerqwer', ',1,2,3,4,'), 
  ('20544', ',1,', '테스트 공지사항 123', '2023-04-17 09:04:55.341000', '3', 'Y', 'N', '2023-04-17 09:05:32.035000', '3', 'all', '테스트', ',2,'), 
  ('20606', ',1,15986,', '테스트 123', '2023-04-17 10:20:13.336000', '3', 'Y', 'N', '2023-04-17 10:20:59.282000', '3', 'all', '테스트123', ',2,3,');
UNLOCK TABLES;

