CREATE DEFINER=always@% FUNCTION nextval() RETURNS bigint(20) unsigned
    MODIFIES SQL DATA
    DETERMINISTIC
BEGIN
     DECLARE ret BIGINT UNSIGNED;
     UPDATE hibernate_sequence SET next_val=next_val+1;
     SELECT next_val INTO ret FROM hibernate_sequence limit 1;
     RETURN ret;
 END


INSERT INTO ux_object (level, object_id, type,  name1,  name2, name3, name4, parent_id, enabled)
values 
(1, 10000, 'menu', '상담포털', NULL, NULL, NULL, NULL, 'Y'),
(2, 11000, 'menu', '상담포털', '홈', NULL, NULL, 10000, 'Y'),
(3, 11100, 'menu', '상담포털', '홈', '홈', NULL, 11000, 'Y'),
(2, 12000, 'menu', '상담포털', '고객목록', NULL, NULL, 10000, 'Y'),
(3, 12100, 'menu', '상담포털', '고객목록', '알림톡', NULL, 12000, 'Y'),
(3, 12200, 'menu', '상담포털', '고객목록', '친구톡', NULL, 12000, 'Y'),
(3, 12300, 'menu', '상담포털', '고객목록', '선물하기', NULL, 12000, 'Y'),
(2, 13000, 'menu', '상담포털', '대화목록', NULL, NULL, 10000, 'Y'),
(3, 13100, 'menu', '상담포털', '대화목록', '상담이력', NULL, 13000, 'Y'),
(3, 13200, 'menu', '상담포털', '대화목록', '상담가이드', NULL, 13000, 'Y'),
(3, 13300, 'menu', '상담포털', '대화목록', '상품설명서', NULL, 13000, 'Y'),
(1, 20000, 'menu', '상담관리', NULL, NULL, NULL, NULL, 'Y'),
(2, 21000, 'menu', '상담관리', '대시보드', NULL, NULL, 20000, 'Y'),
(3, 21100, 'menu', '상담관리', '대시보드', '대시보드', NULL, 21000, 'Y'),
(4, 21101, 'object', '상담관리', '대시보드', '대시보드', '지점 선택', 21000, 'Y'),
(3, 21200, 'menu', '상담관리', '대시보드', '대시보드', NULL, 21000, 'Y'),
(2, 22000, 'menu', '상담관리', '요청관리', NULL, NULL, 20000, 'Y'),
(3, 22100, 'menu', '상담관리', '요청관리', '상담 지원 요청', NULL, 22000, 'Y'),
(3, 22200, 'menu', '상담관리', '요청관리', '톡 발송 요청', NULL, 22000, 'Y'),
(2, 23000, 'menu', '상담관리', '상담', NULL, NULL, 20000, 'Y'),
(3, 23100, 'menu', '상담관리', '상담', '상담 진행 목록', NULL, 23000, 'Y'),
(3, 23200, 'menu', '상담관리', '상담', '상담 이력', NULL, 23000, 'Y'),
(3, 23300, 'menu', '상담관리', '상담', '톡 발송 이력', NULL, 23000, 'Y'),
(2, 24000, 'menu', '상담관리', '상담지원', NULL, NULL, 20000, 'Y'),
(3, 24100, 'menu', '상담관리', '상담지원', '공지사항', NULL, 24000, 'Y'),
(3, 24200, 'menu', '상담관리', '상담지원', '상담가이드', NULL, 24000, 'Y'),
(3, 24500, 'menu', '상담관리', '상담지원', '상품설명서', NULL, 24000, 'Y'),
(3, 24600, 'menu', '상담관리', '상담지원', '금지어', NULL, 24000, 'Y'),
(2, 25000, 'menu', '상담관리', '톡 발송 관리', NULL, '', 20000, 'Y'),
(3, 25100, 'menu', '상담관리', '톡 발송 관리', '톡 발송 관리', NULL, 25000, 'Y'),
(2, 26000, 'menu', '상담관리', '통계', NULL, '', 20000, 'N'),
(3, 26100, 'menu', '상담관리', '통계', '통계', NULL, 26000, 'N'),
(1, 30000, 'menu', '시스템설정', NULL, NULL, NULL, NULL, 'Y'),
(2, 31000, 'menu', '시스템설정', '계정 관리', NULL, NULL, 30000, 'Y'),
(3, 31100, 'menu', '시스템설정', '계정 관리', '권한 관리', NULL, 31000, 'Y'),
(3, 31200, 'menu', '시스템설정', '계정 관리', '브랜치/채널 관리', NULL, 31000, 'Y'),
(3, 31400, 'menu', '시스템설정', '계정 관리', '계정 관리', NULL, 31000, 'Y'),
(2, 32000, 'menu', '시스템설정', '상담 설정', NULL, NULL, 30000, 'Y'),
(3, 32100, 'menu', '시스템설정', '상담 설정', '근무 조건 설정', NULL, 32000, 'Y'),
(3, 32200, 'menu', '시스템설정', '상담 설정', '상담 환경 설정', NULL, 32000, 'Y'),
(3, 32300, 'menu', '시스템설정', '상담 설정', '자동메세지 설정', NULL, 32000, 'Y'),
(3, 32500, 'menu', '시스템설정', '상담 설정', '상담 배분 설정', NULL, 32000, 'Y'),
(2, 39000, 'menu', '시스템설정', '서비스 관리', NULL, NULL, 30000, 'Y'),
(3, 39100, 'menu', '시스템설정', '서비스 관리', '서비스 이용 내역', NULL, 39000, 'Y')
